app/controllers/cars_controller.rb

INSERT INTO "cars" ("color", "year", "mileage", "description", "manufacturer_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["color", "red"], ["year", 2012], ["mileage", 75000], ["description", ""], ["manufacturer_id", 27]]
---
  def create
    @car = Car.new(car_params)
    if @car.save