app/controllers/manufacturers_controller.rb

SELECT "manufacturers".* FROM "manufacturers"
---
  def index
    @manufacturers = Manufacturer.all

INSERT INTO "manufacturers" ("name", "country") VALUES ($1, $2) RETURNING "id"  [["name", "Dodge"], ["country", "USA"]]
---
  def create
    @manufacturer = Manufacturer.new(manufacturer_params)
    if @manufacturer.save