app/views/cars/new.html.erb

  <%= f.label :manufacturer_id %>
    <%= f.collection_select(:manufacturer_id, Manufacturer.all, :id, :name) %>
---
SELECT "manufacturers".* FROM "manufacturers"